const copywriting = {
  register: {
    'NOTICE': '* 请务必使用本人的微信号，一旦认证无法更换\n\n',
    'WELCOME': '支持接受过清华大学学历学位教育的校友和出站博士后校友注册\n\n',
    'WELCOME_NO': '* 暂不支持在校生',
    'UPDATE_PHONE': '为了让您的账户更安全，请设置常用的联系方式',
    'UPDATE_DOCUMENT': '* 请确认证件与本人一致，证件号码准确',
    'UPDATE_DOCUMENT_FACE':
      '* 请确认证件与本人一致，证件号码准确\n即将跳转到微信官方人脸识别认证\n如果人脸识别不成功，可以点选微信支付认证方式',
    'UPDATE_DOCUMENT_CITY':
      '* 请确认证件与本人一致，证件号码准确\n即将跳转到微信官方验证您的微信支付实名信息\n清华人无法获取任何支付权限，请放心使用',
    'UPDATE_DOCUMENT_PAY':
      '* 请确认证件与本人一致，证件号码准确\n即将跳转到微信官方验证您的支付密码\n清华人无法获取输入的密码和支付权限，请放心使用',
  },
  campusInfo: {
    'INTRODUCE':
      '支持接受过清华大学学历学位教育的校友和出站博士后校友注册\n* 暂不支持在校生\n* 如果匹配失败可尝试入校年份+毕业院系',
    'UPDATE_PHONE': '为了让您的账户更安全，请设置常用的联系方式',
    'UPDATE_EXTRA':
      '您可以上传毕业证书等相关证件照片\n帮助我们更快的核实您的信息\n* 长按图片可以移除',
    'UPDATE_EXTRA_WAIT': '您的认证申请已提交，请耐心等待',
  },
  endorse: {
    'SAME_PERSON': '您不能帮助自己认证',
    'UNCERTIFIED': '您还未注册认证成功，无法帮助认证',
    'DIFFERENT_YEAR_DEPARTMENT': '只有同年级同院系的校友才能帮助认证',
    'ALREADY_ENDORSED': '您已经帮助认证，感谢支持',
    'COMPLETED': '您的校友已经完成认证，感谢支持',
    'ALLOW':
      '如果确认是您校友发来的邀请，可以帮助认证\n如果不是，无需进行任何操作\n返回首页，体验更多清华人功能',
  },
  selfie: {
    'UPDATE_SELFIE':
      '证件照将用于校友卡的制作\n一经提交不得修改，请慎重选择\n* 点击上方图像框添加本人证件照\n* 拖动上方图像框调整证件照大小',
    'PREVIEW_SELFIE': '证件照将用于校友卡的制作\n一经提交不得修改，请慎重选择',
  },
  alumniList: {
    'NOT_FOUND': '未找到相关校友',
    'NO_CLASSMATES': '暂无同学',
    'NO_FRIENDS': '暂无好友',
    'NO_IWANTTOBETHEIRFRIENDS': '暂未发出好友申请',
    'NO_THEYWANTTOBEMYFRIENDS': '暂无好友申请',
  },
  donation: {
    'INFO': `自建校之初，清华人就有爱友互助、爱校感恩、爱国奉献的传统。校友总会本着“集心、集力、集智、集资”的原则，为广大校友回馈母校，服务学校发展建设和育人工作提供渠道和支持。\n
    清华校友励学金\n
    “清华校友励学金”工程是清华校友总会于2006年启动的面向校友发起的一项捐资助学工程，它倡导“助困励学、爱校育人”的理念，专项资助由学校认定的家庭经济困难的在校学生，使学生在获得经济资助的同时直接感受到校友给予的精神激励，是清华精神的一种传承，也是校友参与和支持母校人才培养的直接渠道。详情请见“清华校友网”。\n
    年级校友基金\n
    为了更好地开展本年级校友活动、加强校友之间的合作与交流、回馈母校发展与建设，部分本科年级同学以秩年活动为契机在全年级范围发起募捐活动，设立年级校友基金。该年级校友（年级及各院系召集人或理事会）共同决策使用年级校友基金。在符合学校财务规定的情况下，由经年级商定的财务负责人履行相关财务手续。详情请见“清华校友网”。\n
    除上面项目之外，您还可以通过不同的方式和途径：\n
    * 助力学校人才培养\n
    * 助力学校课程建设\n
    * 参与学校校园建设\n
    * 助力学生/校友职业发展\n
    请关注“清华校友网”、清华校友总会微信公众号以及本小程序发布的相关通知公告。\n
    说明：根据国家管理部门的有关政策要求，“清华人”小程序取消了直接回馈母校的功能，给您带来的不便，敬请谅解。已通过“清华人”小程序进行回馈的校友，您的相关信息和要求已保存，总会将按照您填写的信息处理后续信息公布、发票邮寄及刊物订阅等事宜。\n
    `,
  },
  email: {
    RULE: `邮箱名由以下3个部分组成，缺一不可：\n
    （1）姓名每个字的全拼或首字母
    （2）一个小数点
    （3）入学年份四位数字
    `,
    INTRO: `清华校友邮箱（邮箱名@tsinghua.org.cn）是清华校友总会为广大校友提供的免费、长期的电子邮件服务，目前由网易公司提供技术支持。\n
    按照校友会要求，每个校友只支持绑定一个已开通的邮箱。如果您已有开通的校友邮箱，请指定邮箱进行绑定；如果您未曾通过小程序开通校友邮箱，可开通一个新的邮箱并由系统直接绑定。\n
    对于已绑定的校友邮箱，系统将提供重置密码、邮箱停用等自服务功能。访问 mail.tsinghua.org.cn 可登录使用所绑定的校友邮箱。`,
    WEB: `访问 http://mail.tsinghua.org.cn 使用校友邮箱`,
    SELF_SERVICE: `自2017年6月开始，学校为所有在校生预留了校友邮箱\n访问 http://mailservice.tsinghua.org.cn 登录校友邮箱自服务系统，激活校友邮箱`,
    BIND: `访问 http://mail.tsinghua.org.cn 登录校友邮箱，填写获取的验证码完成邮箱绑定`,
  },
}

module.exports = {
  copywriting,
}
